from turtle import * # Підключаємо модуль turtle

reset()      # Ініціалізуємо режим малювання

# === Малюємо квадрат ===
down()       # Опускаємо перо
forward(50)  # Рухаємося вперед на 50 пікселів,
             # тобто зображуємо першу сторону квадрата
left(90)     # Поворот вліво на 90 градусів
forward(50)  # Зображуємо другу сторону квадрата
left(90)     # Поворот вліво на 90 градусів
forward(50)  # Зображуємо третю сторону квадрата
left(90)     # Поворот вліво на 90 градусів
forward(50)  # Зображуємо четверту сторону квадрата
up()         # Підіймаємо перо
# === Зображення квадрата завершено ===

mainloop()       # Затримуємо вікно на екрані

