def rec(N):
    """ Знаходження елементів послідовності використовуючи
        рекурентні співвідношення
    :param N: Номер члена послідовності, що необхідно знайти
    :return:  Знайдений член послідовності.
    """

    a1 = a2 = a3 = 1  # Одночасна ініціалізація кількох
                      # змінних одним значенням
    b = 1
    S = 1 / 2
    # обчислення перших трьох членів послідовності S
    for k in range(1, min(4, N + 1)):
        b = 2 * b
        S = S + 1 / b

    for n in range(4, N + 1):
        b = 2 * b
        a3, a2, a1 = a2, a1, a1 + a3
        S = S + a1 / b

    return S


N = int(input("N = "))
print(rec(N))
