def gen():
    """ Нескінченний генератор """
    x3 = 1
    yield x3, 0  # поверення 0-го члена разом з номером
    x2 = 0
    yield x2, 1  # поверення 1-го члена разом з номером
    x1 = 1
    n = 2        # номер поточного члену послідовності
    yield x1, n  # поверення 2-го члена разом з номером
    while True:  # нескінченний цикл
        n += 1
        x3, x2, x1 = x2, x1, x1 + 2 * x2 + x3
        yield x1, n


a = int(input("a = "))

# Використання генератора
gen_an = gen()
an, n = next(gen_an)         # перший член послідовності
prev_an, prev_n = an, n      # перший член послідовності
while an < a:
    prev_an, prev_n = an, n  # запам'ятовуємо поточний член
                # послідовності та його номер для результату
    an, n = next(gen_an)     # генеруємо чергоий член
                             # послідовності та його номер

print ("x(%d) = %d <= %d = a" % (prev_n, prev_an, a))
