def rec(N, x):
    """ Знаходження елементів послідовності використовуючи
        рекурентні співвідношення
    :param N: Номер члена послідовності, що необхідно знайти
    :param x: Параметр
    :return:  Знайдений член послідовності. """
    a = 1  # початкове значення
    for n in range(1, N + 1):
        a = x / n * a  # можна так: a *= x / n
    return a  # Повертаємо знайдений член послідовності


a = rec(5, 1)  # Обчислюємо 5-й член послідовності
print("a =", a)  # виводимо на екран результат
